# Test Ratings Workbook

In [1]:
import numpy as np
from tqdm import tqdm
from itertools import combinations
import pandas as pd
from recsys.data.rating import RatingsDataset
from recsys.io.file import IOService

# Data

In [2]:
ratings = RatingsDataset(mode='test', filename='train.pkl')

In [3]:
ratings.top_n_users()
ratings.top_n_items()
ratings.get_user_ratings(8089)

       Counts
7231       15
8089       15
3427       11
5044        8
9253        8
13614       8
4083        8
13377       8
12268       7
5385        7

      Counts
212       69
338       67
187       66
226       65
256       63
82        62
372       60
409       59
412       56
1494      56

       userId  movieId  rating   timestamp  useridx  itemidx
5638    80974     1380    3.00   997045681     8089      862
5643    80974     1974    3.00   997118824     8089     1132
6463    80974     5457    4.00  1024183437     8089     2682
6837    80974     5863    3.00  1040841260     8089     2777
7257    80974     6455    3.00  1054316404     8089     2906
8599    80974     8935    2.50  1097280443     8089     3323
8793    80974    31104    3.50  1103918489     8089     3466
10374   80974    40973    3.50  1132474879     8089     3617
10718   80974     6700    3.00  1141785346     8089     2958
10787   80974     4887    2.50  1143750374     8089     2513
12501   80974     5654    2.00  1202254718     8089     2740
13823   80974     8516    4.00  1244763997     8089     3251
14112   80974    53443    3.50  1258589563     8089     3839
14585   80974    79132    4.50  1279495699     8089     4260
15612   80974    86418    3.50  1321568031     8089     4345

In [7]:
ratings.get_user_ratings(8089, mean_centered='user')
ratings.get_user_ratings(8089, mean_centered='item')

       useridx  itemidx  rating
5638      8089      862   -0.23
5643      8089     1132   -0.23
6463      8089     2682    0.77
6837      8089     2777   -0.23
7257      8089     2906   -0.23
8599      8089     3323   -0.73
8793      8089     3466    0.27
10374     8089     3617    0.27
10718     8089     2958   -0.23
10787     8089     2513   -0.73
12501     8089     2740   -1.23
13823     8089     3251    0.77
14112     8089     3839    0.27
14585     8089     4260    1.27
15612     8089     4345    0.27

       useridx  itemidx  rating
5638      8089      862    0.00
5643      8089     1132   -0.10
6463      8089     2682    0.00
6837      8089     2777    0.00
7257      8089     2906   -0.75
8599      8089     3323    0.00
8793      8089     3466    0.00
10374     8089     3617    0.00
10718     8089     2958    0.00
10787     8089     2513   -0.40
12501     8089     2740    0.00
13823     8089     3251    0.00
14112     8089     3839    0.00
14585     8089     4260    0.36
15612     8089     4345    0.00

In [8]:
ratings.get_ave_user_ratings(8089)
ratings.get_ave_item_ratings(212)

3.2333333333333334

4.050724637681159